Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

1.describe:-Descriptive statistics include those that summarize the central tendency, dispersion and shape of a datasetâ€™s distribution, excluding NaN values.

Analyzes both numeric and object series, as well as DataFrame column sets of mixed data types. The output will vary depending on what is provided. Refer to the notes below for more detail.

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

2.unique():-Return unique values based on a hash table.

Uniques are returned in order of appearance. This does NOT sort.

Significantly faster than numpy.unique for long enough sequences. Includes NA values

In [7]:
df["Cabin"].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

3.mean():-Return the mean of the values over the requested axis.

In [8]:
df["Fare"].mean()

32.204207968574636

4.min():-Return the minimum of the values over the requested axis.

In [9]:
df["Fare"].min()

0.0

5.max():-Return the maximum of the values over the requested axis.

In [11]:
df["Fare"].max()

512.3292

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
data=[["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]

In [20]:
df1=pd.DataFrame(data=data,columns=["A","B","C"])

In [21]:
df1

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [30]:
index = pd.Index([1,2,3])

In [32]:
df1=df1.set_index(index)

In [33]:
df1

        A   B       C
1   Alice  25  Female
2     Bob  30    Male
3  Claire  27  Female

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [41]:
df2=pd.DataFrame(data=[10,20,30,40,50],columns=["Values"])

In [45]:
df2.iloc[:3].sum()

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [60]:
df3=pd.DataFrame(data=["Avi","Viraj","Vedant"],columns=["Text"])

In [62]:
df3["Word_Count"]=len(df3["Text"])

In [63]:
df3

     Text  Word_Count
0     Avi           3
1   Viraj           3
2  Vedant           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

df.shape Returns Tuple of array dimensions and df.size returns number of rows multiply by number of columns

In [67]:
df.shape

(891, 12)

In [68]:
df.size

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel():-funtion is used to read an excel file in pandas

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [105]:
data=["avendra@gmail.com","sudh@gmail.com","viraj@gmail.com"]

In [106]:
data[0].split('@')[0]

'avendra'

In [107]:
df4=pd.DataFrame(data=data,columns=["Email"])

In [109]:
def extract_username(email):
    return str(email).split('@')[0]

In [111]:
df4["Username"]=df4["Email"].apply(extract_username)

In [112]:
df4

               Email Username
0  avendra@gmail.com  avendra
1     sudh@gmail.com     sudh
2    viraj@gmail.com    viraj

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [129]:
data=[[3 ,5 ,1],[8 ,2 ,7],[6 ,9 ,4],[2 ,3 ,5],[9 ,1 ,2]]

In [130]:
df5=pd.DataFrame(data=data,columns=["A","B","C"])

In [131]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [133]:
df5[df5["A"]>5]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [134]:
df5[df5["B"]<10]

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [140]:
df5[(df5["A"]>5) & (df5["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [144]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [142]:
df2.mean()

Values    30.0
dtype: float64

In [143]:
df2.median()

Values    30.0
dtype: float64

In [145]:
df2.std()

Values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [16]:
data1=[[232,"2023-01-01"],[432,"2023-01-02"],[252,"2023-01-03"],[534,"2023-01-04"],[987,"2023-01-05"],[542,"2023-01-06"],[762,"2023-01-07"]]

In [17]:
df3=pd.DataFrame(data=data1,columns=["Sales","Date"])

In [18]:
df3

   Sales        Date
0    232  2023-01-01
1    432  2023-01-02
2    252  2023-01-03
3    534  2023-01-04
4    987  2023-01-05
5    542  2023-01-06
6    762  2023-01-07

In [19]:
df3["MovingAverage"]=df3["Sales"].mean()

In [20]:
df3

   Sales        Date  MovingAverage
0    232  2023-01-01     534.428571
1    432  2023-01-02     534.428571
2    252  2023-01-03     534.428571
3    534  2023-01-04     534.428571
4    987  2023-01-05     534.428571
5    542  2023-01-06     534.428571
6    762  2023-01-07     534.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [21]:
data3=["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]

In [22]:
df4=pd.DataFrame(data=data3,columns=["Date"])

In [23]:
df4

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [51]:
import datetime

In [52]:
def Weekdays(date):
    year,month,day=date.split('-')
    day_name = datetime.date(int(year), int(month), int(day)) 
    return day_name.strftime("%A")

In [53]:
df4["Weekday"]=df4["Date"].apply(Weekdays)

In [54]:
df4

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [6]:
data4=["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05","2023-02-22","2023-03-21"]

In [7]:
df5=pd.DataFrame(data=data4,columns=["Date"])

In [8]:
df5['Date'] = pd.to_datetime(df5['Date'])

In [9]:
mask = (df5['Date'] > '2023-01-01') & (df5['Date'] <= '2023-01-31')

In [13]:
mask

0    False
1     True
2     True
3     True
4     True
5    False
6    False
Name: Date, dtype: bool

In [11]:
df5.loc[mask]

        Date
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

We need to import pandas first and we can also give alias